[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(`HelpRequest Updated - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`);
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestEditPage.js:45:11
   });
 
   const onSuccess = (helprequest) => {
-    toast(`HelpRequest Updated - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`);
+    toast(``);
   };
 
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "HelpRequest Updated - id: 17 requesterEmail: hjin133@csil.cs.ucsb.edu"
Received: ""

Number of calls: 1
