[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:73:23
           type="text"
           isInvalid={Boolean(errors.teamId)}
           {...register("teamId", {
-            required: "Team Id is required.",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:89:47
           id="tableOrBreakoutRoom"
           type="text"
           isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-          {...register("tableOrBreakoutRoom", {
-            required: "Table Or Breakout Room is required.",
-          })}
+          {...register("tableOrBreakoutRoom", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table Or Breakout Room is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:110:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestTime && "Request Time is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:110:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestTime && "Request Time is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:135:34
           id="solved"
           type="checkbox"
           isInvalid={Boolean(errors.explanation)}
-          {...register("solved", {
-            required: "Solved is required.",
-          })}
+          {...register("solved", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
