[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/helprequest/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequest/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/helprequest/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequest/edit/2"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:43:5
       accessor: "id", // accessor is the "key" in the data
     },
 
-    {
-      Header: "Requester Email",
-      accessor: "requesterEmail",
-    },
+    {},
     {
       Header: "Team Id",
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:47:5
       Header: "Requester Email",
       accessor: "requesterEmail",
     },
-    {
-      Header: "Team Id",
-      accessor: "teamId",
-    },
+    {},
     {
       Header: "Table Or Breakout Room",
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:51:5
       Header: "Team Id",
       accessor: "teamId",
     },
-    {
-      Header: "Table Or Breakout Room",
-      accessor: "tableOrBreakoutRoom",
-    },
+    {},
     {
       Header: "Request Time",
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:57:17
     },
     {
       Header: "Request Time",
-      accessor: "requestTime",
+      accessor: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:65:17
     },
     {
       Header: "Solved",
-      accessor: "solved",
+      accessor: "",
     },
   ];
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
