[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helprequest) => ({
-    url: "/api/helprequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helprequest) => ({
-    url: "/api/helprequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helprequest) => ({});
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:10:13
 export default function HelpRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (helprequest) => ({
     url: "/api/helprequest/post",
-    method: "POST",
+    method: "",
     params: {
       requesterEmail: helprequest.requesterEmail,
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helprequest) => {
     toast(
-      `New helprequest Created - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New helprequest Created - id: 2 requesterEmail: hjin133@ucsb.edu"
Received: ""

Number of calls: 1
