[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helprequest) => ({
-    url: "/api/helprequest",
-    method: "PUT",
-    params: {
-      id: helprequest.id,
-    },
-    data: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "HelpRequest Updated - id: 17 requesterEmail: hjin133@csil.cs.ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/HelpRequest/HelpRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helprequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helprequest}
-          />
-        )}
+        {helprequest || <HelpRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={helprequest} />}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, requesterEmail, teamId, tableOrBreakoutRoom, requestTime, explanation, solved}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helprequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helprequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
