[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.js:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/helprequest/all"],
-    { method: "GET", url: "/api/helprequest/all" },
+    { method: "", url: "/api/helprequest/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HelpRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/helprequest/all"
Received string:    "Error communicating with backend via  on /api/helprequest/all"

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/helprequest/create"
-          style={{ float: "right" }}
-        >
-          Create HelpRequest
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create HelpRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/helprequest/create"
-          style={{ float: "right" }}
-        >
-          Create HelpRequest
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create HelpRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestIndexPage.js:30:18
         <Button
           variant="primary"
           href="/helprequest/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create HelpRequest
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
