[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:118:36
           id="comments"
           type="text"
           isInvalid={Boolean(errors.comments)}
-          {...register("comments", {
-            required: "Comments is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("comments", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed - Reviewer Email
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
