[Killed] ObjectLiteral
main/components/MenuItems/MenuItemForm.js:44:45
           id="diningCommonsCode"
           type="text"
           isInvalid={Boolean(errors.diningCommonsCode)}
-          {...register("diningCommonsCode", {
-            required: "Dining Commons Code is required",
-          })}
+          {...register("diningCommonsCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Dining Commons Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItems/MenuItemForm.js:60:32
           id="name"
           type="text"
           isInvalid={Boolean(errors.name)}
-          {...register("name", {
-            required: "Name is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
-          })}
+          {...register("name", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
