[Killed] BooleanLiteral
main/pages/MenuItems/MenuItemCreatePage.js:7:58
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function MenuItemCreatePage({ storybook = false }) {
+export default function MenuItemCreatePage({ storybook = true }) {
   const objectToAxiosParams = (menuItem) => ({
     url: "/api/UCSBDiningCommonsMenuItem/post",
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /menuItem
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/menuItems"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/MenuItems/MenuItemCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: menuItem.diningCommonsCode,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /menuItem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MenuItems/MenuItemCreatePage.js:9:10
 
 export default function MenuItemCreatePage({ storybook = false }) {
   const objectToAxiosParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /menuItem
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New menu Item Created - id: 9 name: South Coast Deli"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItems/MenuItemCreatePage.js:18:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`New menu Item Created - id: ${menuItem.id} name: ${menuItem.name}`);
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /menuItem
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New menu Item Created - id: 9 name: South Coast Deli"

Number of calls: 0
