[Killed] BooleanLiteral
main/pages/MenuItems/MenuItemEditPage.js:8:56
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function MenuItemEditPage({ storybook = false }) {
+export default function MenuItemEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/menuItems"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/MenuItems/MenuItemEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/UCSBDiningCommonsMenuItem`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MenuItems/MenuItemEditPage.js:41:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`Menu Item Updated - id: ${menuItem.id} name: ${menuItem.name}`);
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/MenuItems/MenuItemEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuItem && (
-          <MenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItems/MenuItemEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuItem && (
-          <MenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {menuItem || <MenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuItem} />}
       </div>
     </BasicLayout>
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, diningCommonsCode, name, station}). If you meant to render a collection of children, use an array instead.
