[Killed] BlockStatement
main/pages/MenuItems/MenuItemIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuItems/create"
-          style={{ float: "right" }}
-        >
-          Create Menu Item
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: MenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MenuItems/MenuItemIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuItems/create"
-          style={{ float: "right" }}
-        >
-          Create Menu Item
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: MenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
